---
kind: enumMember
id: F:Autodesk.Revit.DB.ImportColorMode.Preserved
enum: Autodesk.Revit.DB.ImportColorMode
source: html/a56dc03e-053b-769e-ad25-c76a9c8f0e5d.htm
---
# Autodesk.Revit.DB.ImportColorMode.Preserved

Colors in the imported drawing are preserved.